In [1]:
pip install sqlalchemy psycopg2 pandas

Requirement already satisfied: sqlalchemy in c:\users\adams\anaconda3\lib\site-packages (1.3.9)
Requirement already satisfied: psycopg2 in c:\users\adams\anaconda3\lib\site-packages (2.9.1)
Requirement already satisfied: pandas in c:\users\adams\anaconda3\lib\site-packages (0.25.1)
Requirement already satisfied: python-dateutil>=2.6.1 in c:\users\adams\anaconda3\lib\site-packages (from pandas) (2.8.0)
Requirement already satisfied: numpy>=1.13.3 in c:\users\adams\anaconda3\lib\site-packages (from pandas) (1.16.5)
Requirement already satisfied: pytz>=2017.2 in c:\users\adams\anaconda3\lib\site-packages (from pandas) (2019.3)
Requirement already satisfied: six>=1.5 in c:\users\adams\anaconda3\lib\site-packages (from python-dateutil>=2.6.1->pandas) (1.12.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
from sqlalchemy import create_engine

In [3]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

In [27]:
#ZAD1
df = pd.read_sql("select distinct category_id from film_category order by category_id DESC",con=connection)
print("Ilość kategorii to:")
print(df.count())

Ilość kategorii to:
category_id    16
dtype: int64

In [28]:
#ZAD2
df = pd.read_sql("select name from category order by name ASC",con=connection)
print(df)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

In [29]:
#ZAD3
df = pd.read_sql("select title, release_year from film order by release_year ASC",con=connection)
print("Najmlodszy")
print(df["title"][0])
print("Najstarszy")
print(df['title'][df.count()-1])

Najmlodszy
Chamber Italian
Najstarszy
999    Zorro Ark
999    Zorro Ark
Name: title, dtype: object

In [23]:
#ZAD4
df = pd.read_sql("select count(*) from rental where rental_date between '2005-07-01'::timestamp and '2005-08-01'::timestamp",con=connection)
print("Ilość wypożyczeń między 2005-07-01 a 2005-08-01")
print(df)

Ilość wypożyczeń między 2005-07-01 a 2005-08-01
   count
0   6709

In [25]:
#ZAD5
df = pd.read_sql("select count(*) from rental where rental_date between '2010-01-01'::timestamp and '2011-02-01'::timestamp",con=connection)
print("Ilość wypożyczeń między 2010-01-01 a 2011-02-01")
print(df)

Ilość wypożyczeń między 2010-01-01 a 2011-02-01
   count
0      0

In [30]:
#ZAD6
df = pd.read_sql("select rental_id, amount from payment order by amount DESC",con=connection)
print(df)
print("Najwieksza opłata za wypożyczenie to")
print(df["amount"][0])

       rental_id  amount
0          14763   11.99
1           3973   11.99
2           8831   11.99
3          15415   11.99
4           4383   11.99
...          ...     ...
14591      11782    0.00
14592      12352    0.00
14593      15717    0.00
14594      15407    0.00
14595      13577    0.00

[14596 rows x 2 columns]
Najwieksza opłata za wypożyczenie to
11.99

In [37]:
#ZAD7
df = pd.read_sql("select customer.first_name, customer. last_name, \
                           country.country \
                           from country \
                           left join city \
                           on country.country_id = city.country_id \
                           left join address \
                           on city.city_id = address.city_id \
                           left join customer \
                           on address.address_id = customer.address_id \
                           where country.country in ('Poland', 'Nigeria', 'Bangladesh') \
                           ",
                           con=connection)
print("Klienci z Polski, Nigerii i Bangladeszu")
print(df)

Klienci z Polski, Nigerii i Bangladeszu
   first_name  last_name     country
0       Sonia    Gregory     Nigeria
1       Brian      Wyman      Poland
2      Sidney   Burleson      Poland
3      Rodney    Moeller     Nigeria
4     Stephen     Qualls  Bangladesh
5       Velma      Lucas     Nigeria
6     Marilyn       Ross     Nigeria
7       Elsie     Kelley     Nigeria
8      Gladys   Hamilton     Nigeria
9       Frank   Waggoner  Bangladesh
10   Marjorie     Tucker      Poland
11      Carol     Garcia     Nigeria
12       Leah     Curtis      Poland
13      Ruben      Geary      Poland
14       Olga    Jimenez     Nigeria
15     Bertha   Ferguson     Nigeria
16     Tracey    Barrett     Nigeria
17         Jo     Fowler     Nigeria
18    Johnnie   Chisholm      Poland
19    Wallace      Slone     Nigeria
20   Michelle      Clark  Bangladesh
21    Russell    Brinson      Poland
22     Jimmie  Eggleston      Poland
23  Constance       Reid     Nigeria

In [43]:
#ZAD8
df = pd.read_sql("select staff.first_name, staff.last_name, \
                           country, city, address.address \
                           from staff \
                           left join address \
                           on staff.address_id = address.address_id \
                           left join city \
                            on address.city_id = city.city_id \
                            left join country \
                            on city.country_id = country.country_id", 
                           con=connection)
print("Adresy zamieszkania personelu")
print(df)

Adresy zamieszkania personelu
  first_name last_name    country        city               address
0       Mike   Hillyer     Canada  Lethbridge     23 Workhaven Lane
1        Jon  Stephens  Australia   Woodridge  1411 Lillydale Drive

In [45]:
#ZAD9
df = pd.read_sql("select count(*) \
                                  from staff \
                                  left join address \
                                  on staff.address_id = address.address_id \
                                  left join city \
                                  on address.city_id = city.city_id \
                                  left join country \
                                  on city.country_id = country.country_id \
                                  where country.country in ('Argentina', 'Spain')",
                                  con=connection)
print("Liczba pracowników mieszkających w Hiszpanii lub Argentynie")
print(df)

Liczba pracowników mieszkających w Hiszpanii lub Argentynie
   count
0      0

In [48]:
#ZAD10
df = pd.read_sql("select distinct category.name, count(category.name) \
                                    from rental \
                                    left join inventory \
                                    on rental.inventory_id = inventory.inventory_id \
                                    left join film \
                                    on inventory.film_id = film.film_id \
                                    left join film_category \
                                    on film.film_id = film_category.film_id \
                                    left join category \
                                    on film_category.category_id = category.category_id \
                                    group by category.name",
                                    con=connection)
print("Kategorie filmów wypożyczone przez klientów")
print(df)

Kategorie filmów wypożyczone przez klientów
           name  count
0        Action   1112
1     Animation   1166
2      Children    945
3      Classics    939
4        Comedy    941
5   Documentary   1050
6         Drama   1060
7        Family   1096
8       Foreign   1033
9         Games    969
10       Horror    846
11        Music    830
12          New    940
13       Sci-Fi   1101
14       Sports   1179
15       Travel    837

In [51]:
#ZAD11
df = pd.read_sql("select distinct category.name, count(category.name) \
                                              from rental \
                                              left join inventory \
                                              on rental.inventory_id = inventory.inventory_id \
                                              left join film \
                                              on inventory.film_id = film.film_id \
                                              left join film_category \
                                              on film.film_id = film_category.film_id \
                                              left join category \
                                              on film_category.category_id = category.category_id \
                                              left join customer \
                                              on customer.customer_id = rental.customer_id \
                                              left join address \
                                              on address.address_id = customer.address_id \
                                              left join city \
                                              on address.city_id = city.city_id \
                                              left join country \
                                              on country.country_id = city.country_id \
                                              where country.country in ('United States') \
                                              group by category.name \
                                              ",
                                              con=connection)
print("Kategorie wypożyczone w Ameryce")
print(df)

Kategorie wypożyczone w Ameryce
           name  count
0        Action     62
1     Animation     68
2      Children     56
3      Classics     54
4        Comedy     59
5   Documentary     74
6         Drama     69
7        Family     66
8       Foreign     64
9         Games     60
10       Horror     62
11        Music     51
12          New     55
13       Sci-Fi     62
14       Sports     73
15       Travel     33

In [52]:
#ZAD12
df = pd.read_sql("select film.title, actor.first_name, actor.last_name \
                        from film \
                        left join film_actor \
                        on film.film_id = film_actor.film_id \
                        left join actor \
                        on film_actor.actor_id = actor.actor_id \
                        where (actor.first_name = 'Olympia' and actor.last_name = 'Pfeiffer') or \
                              (actor.first_name = 'Julia' and actor.last_name = 'Zellweger') or \
                              (actor.first_name = 'Ellen' and actor.last_name = 'Presley') \
                        ", con=connection)
print("Filmy w których zagrali Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley")
print(df)

Filmy w których zagrali Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley
                title first_name  last_name
0     Bilko Anonymous      Ellen    Presley
1   Caribbean Liberty      Ellen    Presley
2    Casper Dragonfly      Ellen    Presley
3    Empire Malkovich      Ellen    Presley
4       Floats Garden      Ellen    Presley
..                ...        ...        ...
64       Outlaw Hanky      Julia  Zellweger
65    Panky Submarine      Julia  Zellweger
66   Rider Caddyshack      Julia  Zellweger
67          Won Dares      Julia  Zellweger
68      Wyoming Storm      Julia  Zellweger

[69 rows x 3 columns]